Repository: elementary/portals
Catalog: po/extra/*.po
Languages: ca, cs, es, fr, he, hu, ja, pl, ru, uk

source: Portals
cs: Portály
es: Portales
fr: Portails
he: שערי גישה
hu: Portálok
ja: ポータル
pl: Portale
ru: Порталы
uk: Портали

source: Access system features in a secure way
ca: Accediu a les funcions del sistema d'una manera segura
cs: Bezpečný přístup k funkcím systému
es: Acceder a las características del sistema de una forma segura
fr: Accédez à des fonctionnalités de système de façon sécurisée
he: גישה ליכולות המערכת בצורה מאובטחת
hu: Rendszerfunkciók elérése biztonságos módon
ja: 安全な方法でシステムの機能にアクセスします
pl: Bezpieczny dostęp do funkcji systemu
ru: Безопасный доступ к функциям системы
uk: Безпечний доступ до можливостей системи

source: Portals provide APIs to secure apps which enable them to access system features while requiring informed consent.
ca: Els Portals proporcionen API per assegurar les aplicacions que permeten accedir a les funcions del sistema i que requereixen un consentiment informat.
cs: Portály poskytuje aplikační program. rozhraní (API) bezpečným aplikacím, kterým umožní přístup k funkcím systému a přitom vyžaduje informovaný souhlas.
es: Los portales proporcionan API a las aplicaciones que les permiten acceder a características del sistema de formar segura y requiriendo consentimiento informado.
fr: Portails fournit une API pour sécuriser les applications en leur donnant l'accès aux fonctionnalités du système après avoir demandé un consentement éclairé.
he: שערי גישה מספק מנשקי API ליישומים מאובטחים שמאפשרים להם לגשת ליכולות במערכת תוך בקשת הסכמה מודעת.
hu: A Portálok API-okat biztosítanak ahhoz, hogy az alkalmazások biztonságosan érhessenek el rendszerfunkciókat, miközben erről tájékoztatnak és beleegyezést kérnek.
ja: “ポータル”は、安全なアプリが事前にユーザーからの許可を得てシステムの機能にアクセスできる API を提供します。
pl: Portale zapewniają interfejsy API do zabezpieczania aplikacji, które umożliwiają im dostęp do funkcji systemu, wymagając przy tym świadomej zgody.
ru: Порталы предоставляют API для защиты приложений, которые дают им доступ к функциям системы, но требуя явного согласия.
uk: Портали надають API для захисту застосунків, які дають їм доступ до системних можливостей, але вимагають явної згоди.

source: New Features:
ca: Característiques noves:
cs: Nové funkce:
es: Nuevas características:
fr: Nouvelles fonctionnalités :
he: יכולות חדשות:
hu: Új funkciók:
ja: 新機能:
pl: Nowe funkcje:
ru: Новые возможности:
uk: Нові функції:

source: Updated translations
ca: Traduccions actualitzades
cs: Aktualizované překlady
es: Traducciones actualizadas
fr: Mise à jour des traductions
he: התרגומים עודכנו
hu: Frissített fordítások
ja: 翻訳の更新
pl: Zaktualizowano tłumaczenia
ru: Обновлены переводы
uk: Оновлені переклади

source: Support dialog parenting on wayland
ca: Suport a parentiu de diàlegs a Wayland
es: Se agregó soporte para cuadros de diálogo con padres en wayland
fr: Prise en charge de la hiérarchisation des fenêtres sur wayland
he: תמיכה בהורות של חלוניות ב־wayland
hu: Dialógusok szülői felügyelet alá helyezésének támogatása waylanden
ja: Wayland において、ポータルダイアログを親ウィンドウの上に表示できるように修正
pl: Wsparcie dla określania rodzica dialogu w waylandzie
ru: Поддержка наследования диалоговых окон на Wayland
uk: Підтримка діалогового вікна вкладеності на wayland

source: Add a destructive action option for access portals
ca: Addició d'una opció d'acció destructiva per als portals d'accés
cs: Přidány volby pro destruktivní akce pro přístupové portály
es: Se agregó una opción de acción destructiva para portales de acceso
fr: Ajout d'une option d'action destructrice pour les portails d'accès
he: הוספת אפשרות פעולה הרסנית לשערי גישה
hu: Destruktív művelet a hozzáférési portálokhoz
ja: アクセスポータルに破壊的なアクションを行うオプションを追加
pl: Dodano opcję destruktywnej akcji dla portali dostępu
ru: Добавлены опции деструктивного действия для доступа к порталам
uk: Додано опції деструктивної дії для доступу до порталів

source: Fixes:
ca: Correccions:
cs: Opravy:
es: Correcciones:
fr: Corrections :
he: תיקונים:
hu: Javítások:
ja: 修正点:
pl: Poprawki:
ru: Исправления:
uk: Виправлення:

source: Fix a crash when opening apps in the AppChooser portal
ca: Correcció d'un error en obrir aplicacions al portal AppChooser
cs: Opraven pád při otevírání aplikací v portálu AppChooser
es: Se corrigió una falla grave cuando se abren aplicaciones con el portal de selección de aplicación (AppChooser)
fr: Correction d'un plantage lors de l'ouverture d'applications via le portail de sélection d'application
he: תיקון קריסה בעת פתיחת יישומים בשער בוחר היישומים
hu: Javítva egy összeomlás az alkalmazásválasztó portálban való választáskor
ja: アプリ選択ポータルからアプリを開く際にクラッシュしないように修正
pl: Naprawiono błąd krytyczny przy otwieraniu aplikacji przez portal AppChooser
ru: Исправлен сбой при открытии приложений в портале AppChooser
uk: Усунуто збої при відкритті застосунків через портал вибору застосунків

source: Fix window focus and position for Access portals with no parent window
ca: Correcció de l'enfocament i la posició de la finestra per als portals d'Accés sense finestra principal
cs: Opraveno zaměření okna a pozice pro přístupové portály postrádající nadřazené okno
es: Se corrige el foco de la ventana y la posición para portales de acceso sin ventana padre
fr: Correction de la mise au point et de la position de la fenêtre pour les portails d'accès sans fenêtre parente
he: תוקן מיקוד ומיקום חלון לשערי גישה ללא חלון הורה
hu: A szülőablakkal nem rendelkező portálok helyzete és fókusza javítva
ja: 親ウィンドウのないアクセスポータルウィンドウが、フォーカスされ正しい位置に表示されるように修正
pl: Naprawiono fokus okna i pozycję dla portali dostępu bez okna rodzica
ru: Исправлена фокусировка и положение окна для порталов Access без родительского окна
uk: Виправлено фокусування вікна та положення для доступу до порталів без батьківського вікна

source: Set AppChooser portal as a modal dialog for proper animations
ca: S'estableix el portal AppChooser com a diàleg modal per a animacions adequades.
cs: Nastaven AppChooser portál jako modální dialog a tím správné animace
es: Se establece el portal de selección de aplicaciones (AppChooser) como un diálogo modal con animaciones adecuadas
fr: Le portail de sélection d'application est désormais une boîte de dialogue pour des animations plus appropriées
he: שער בוחר היישומים הוגדר כחלונית לוכדת לטובת הנפשה הולמת
hu: Az alkalmazásválasztó portál egy modális dialógusablak lett a megfelelő animációk érdekében
ja: アプリ選択ポータルをモーダルダイアログに変更し、適切にアニメーション表示されるように修正
pl: Ustawiono portal AppChooser jako dialog modalny dla poprawnych animacji
ru: Портал AppChooser установлен в качестве модального диалога для правильной анимации
uk: Портал вибору застосунків установлено модальним вікном для правильної анімації

source: Prevent delay after logging in
ca: S'evita el retard després d'iniciar sessió
cs: Zabráněno prodlevě po přihlášení se
es: Se evita un retraso después de iniciar sesión
fr: Correction d'un éventuel délai après la connexion
he: נמנענ השהיה אחרי הכניסה
hu: Bejelentkezés utáni késleltetés megelőzése
ja: ログイン後の遅延を修正
pl: Zapobiegaj opóźnieniom po zalogowaniu
ru: Предотвращена задержка после входа в систему
uk: Запобігання затримці після входу

source: First release!
fr: Première version !
pl: Pierwsze wydanie!

source: Add OpenURI Portal
fr: Ajout du portail OpenURI
pl: Dodaj portal OpenURI

source: elementary, Inc.
he: elementary בע״מ.
