Repository: elementary/portals
Catalog: po/*.po
Languages: be, fi, nn

source: Deny Access
be: Адхіліць запыт
fi: Estä pääsy
nn: Ikkje gje tilgang

source: Grant Access
be: Даць доступ
fi: Myönnä pääsy
nn: Gje tilgang

source: Open “%s” with…
be: Адкрыць “%s” праз…
fi: Avaa “%s” sovelluksella…
nn: Opna "%s" med…

source: No installed apps can open %s
be: Няма праграм для адкрыцця %s
fi: Mikään asennettu sovellus ei voi avata kohdetta %s
nn: Du har ingen innstallerte appar som kan opna %s

source: New apps can be installed from AppCenter
be: Можна ўсталяваць новыя праграмы з AppCenter
fi: Uusia sovelluksia voi asentaa Sovelluskeskuksesta
nn: Nye appar kan du installera i AppCenter

source: Cancel
be: Скасаваць
fi: Peru
nn: Avbryt

source: Open
be: Адкрыць
fi: Avaa
nn: Opna

source: Allow
be: Дазволіць
fi: Salli

source: Forbid
be: Забараніць
fi: Estä

source: Background activity
be: Фонавая актыўнасць
fi: Taustatoimintaa

source: “%s” is running in the background without appropriate permission
be: “%s” запушчана ў фонавым рэжыме без адпаведнага дазволу
fi: “%s” on käynnissä taustalla ilman soveltuvaa käyttöoikeutta

source: Custom Command
be: Карыстальніцкая каманда

source: Entire Display
be: Увесь экран

source: Share
be: Пачаць

source: Unknown Window
be: Невядомае акно

source: Windows
be: Вокны

source: Monitors
be: Маніторы

source: Clockwise
be: Па ходу гадзіннікавай стрэлкі

source: Upside-down
be: Уверх дном

source: Counterclockwise
be: Супраць ходу гадзіннікавай стрэлкі

source: Flipped
be: Адлюстраваны

source: Flipped Clockwise
be: Адлюстраваны, па ходу гадзіннікавай стрэлкі

source: Flipped Upside-down
be: Адлюстраваны, уверх дном

source: Flipped Counterclockwise
be: Адлюстраваны, супраць ходу гадзіннікавай стрэлкі

source: None
be: Няма

source: Screen
be: Экран

source: Window
be: Акно

source: Area
be: Вобласць

source: Grab pointer:
be: Захапіць указальнік:

source: Delay in seconds:
be: Затрымка ў секундах:

source: Take Screenshot
be: Зрабіць здымак экрана

source: Close
be: Закрыць

source: Conceal text:
be: Схаваць тэкст:

source: Open file with…
fi: Avaa sovelluksella…
nn: Opna fila med…

source: An application requested to open a %s.
fi: Sovellus haluaa avata %s.
nn: Ein applikasjon ynskjer å opna ein %s.

source: “%s” requested to open a %s.
fi: “%s” pyysi avata %s.
nn: "%s" ynskjer å opna ein %s.
